Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриобретениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПриобретениеТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПроверкиКорректностиДанных/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПроверитьКорректностьЗаполненияДокумента(ДокументОбъект, Отказ = Ложь) Экспорт
	
	// Заполним массив необходимых проверок в зависимости от типа документа
	МассивПроверок = Новый Массив();
	ИмяТаблицы     = ДокументОбъект.Метаданные().ПолноеИмя();
	
	Если ИмяТаблицы = "Документ.РеализацияТоваровИУслуг" Тогда
		
		МассивПроверок.Добавить("ТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладов");
		МассивПроверок.Добавить("ДублиТоваров");
		
	ИначеЕсли ИмяТаблицы = "Документ.ПриобретениеТоваровИУслуг" Тогда
		
		МассивПроверок.Добавить("ТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладов");
		
	КонецЕсли;
	
	// Сформируем текст запроса необходимых проверок в соответствие с массивом проверок
	ТекстЗапроса     = "";
	ПараметрыЗапроса = Новый Структура;
	
	ПараметрыЗапроса.Вставить("Дата",   ДокументОбъект.Дата);
	ПараметрыЗапроса.Вставить("Ссылка", ДокументОбъект.Ссылка);
	
	Для Каждого ИмяПроверки Из МассивПроверок Цикл
		
		Если ИмяПроверки = "ТаблицаТовары" Тогда
			
			СформироватьЗапросТаблицаТовары(ТекстЗапроса, ПараметрыЗапроса, ДокументОбъект, ИмяТаблицы);
			
		ИначеЕсли ИмяПроверки = "КорректностьЗаполненияСкладов" Тогда
			
			СформироватьЗапросКорректностьЗаполненияСкладов(ТекстЗапроса);
			
		ИначеЕсли ИмяПроверки = "ДублиТоваров" Тогда
			
			СформироватьЗапросДублиТоваров(ТекстЗапроса);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	// Сообщим пользователю о результатах проверки для каждого результата запроса
	Для ИндексПроверки = 0 По РезультатПакета.Количество()-1 Цикл
		
		Выборка = РезультатПакета[ИндексПроверки].Выбрать();
		ИмяПроверки = МассивПроверок[ИндексПроверки];
		
		Если ИмяПроверки = "КорректностьЗаполненияСкладов" Тогда
			
			СообщитьОбОшибкахКорректностьЗаполненияСкладов(Выборка, ДокументОбъект, Отказ);
			
		ИначеЕсли ИмяПроверки = "ДублиТоваров" Тогда
			
			СообщитьОбОшибкахДублиТоваров(Выборка, ДокументОбъект, Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыФормированияЗапросовПроверкиКорректностиЗаполненияДокументов

Процедура СформироватьЗапросТаблицаТовары(ТекстЗапроса, ПараметрыЗапроса, ДокументОбъект, ИмяТаблицы)
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительЗапросовВПакете();
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары";
	
	ПараметрыЗапроса.Вставить("Товары", ДокументОбъект.Товары.Выгрузить(, "НомерСтроки, Склад, Номенклатура"));
	
КонецПроцедуры

Процедура СформироватьЗапросКорректностьЗаполненияСкладов(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительЗапросовВПакете() + 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|	И Товары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	
КонецПроцедуры

Процедура СформироватьЗапросДублиТоваров(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительЗапросовВПакете() + 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура) КАК НоменклатураПредставление,
	|	Товары.Склад КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(Товары.Склад) КАК СкладПредставление
	|ИЗ
	|	Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Склад,
	|	Товары.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1";
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДляВыводаСообщенийОбОшибкахЗаполненияДокументов

Процедура СообщитьОбОшибкахКорректностьЗаполненияСкладов(Выборка, ДокументОбъект, Отказ)
	
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибки = СтрШаблон("Не заполнена колонка ""Склад"" в строке %1 списка ""Товары""",
			Выборка.НомерСтроки);
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ДокументОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "Склад"),,
			Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СообщитьОбОшибкахДублиТоваров(Выборка, ДокументОбъект, Отказ)
	
	Пока Выборка.Следующий() Цикл
		
		
		Если ЗначениеЗаполнено(Выборка.Склад) Тогда
			ТекстОшибки = СтрШаблон("Номенклатура ""%1"" со складом ""%2"" повторяется",
				Выборка.НоменклатураПредставление,
				Выборка.СкладПредставление);
		Иначе
			ТекстОшибки = СтрШаблон("Номенклатура ""%1"" повторяется",
				Выборка.НоменклатураПредставление);
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(
		ТекстОшибки,
		ДокументОбъект,
		ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "Номенклатура"),
		,
		Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
